# 元组

"""
1、创建元组
"""
my_tuple = ()  # 创建了一个空元组
# 输出：()
print(my_tuple)

# 创建了一个5个元素的元组
my_tuple = (1, 2, 3, 4, 5)
# 输出：(1, 2, 3, 4, 5)
print(my_tuple)
#  当元组不是空元组时，括号可以省略
my_tuple = 1, 2, 3, 4, 5
# 输出：(1, 2, 3, 4, 5)
print(my_tuple)

"""
1、元组的解包
解包指就是将元组当中每一个元素都赋值给一个变量。
"""
my_tuple = 10, 20, 30, 40
a, b, c, d = my_tuple
# 输出：10 20 30 40
print(a, b, c, d)

# a，b元素的交互
a = 100
b = 300
a, b = b, a
# 输出：300 100
print(a, b)

"""
在对一个元组进行解包时，变量的数量必须和元组中的元素的数量一致；
也可以在变量前边添加一个*，这样变量将会获取元组中所有剩余的元素。
"""
my_tuple = 10, 20, 30, 40
a, b, *c = my_tuple
# 输出：10 20 [30, 40]
print(a, b, c)
